app/views/partials/_institution_selectors.html.erb

      <label for="inst_filter">Filter by Institution</label>
      <select name="inst_filter" id="inst_filter" class="form-control" size="1" onkeypress="handleLookupFilter(this.value,'inst');" alt="institution filter" title="institution filter">
---
SELECT "institutions".* FROM "institutions"   ORDER BY name