app/controllers/pages_controller.rb

  def home
    get_filter_options
    @notice = Notice.order("updated_at DESC").limit(1)
---
SELECT  "notices".* FROM "notices"   ORDER BY updated_at DESC LIMIT 1